START_MESSAGE = 'Привет!\n' \
                'Устал искать свое уютное гнездышко? Доверься мне!\n' \
                'Я могу подобрать случайную квартиру по твоим основным критериям ' \
                'из базы недвижимости ЦИАН (https://cian.ru/).'

SETTINGS_FROM_START = "Как минимум, выберите город и тип предложения."

SEARCH_TERMS = "Настройка критериев поиска."

GET_CITY = "Укажите город."
GET_DEAL_TYPE = "Ищем, чтобы снять или купить?"
GET_UNDERGROUND1 = "Выберите интересующую ветку метро."
GET_UNDERGROUND2 = "Выберите ближайшую станцию метро."
GET_ROOMS = "Выберите количество комнат. Можно выбрать несколько вариантов.\n" \
            "Чтобы убрать один из вариантов, нажмите на него еще раз."
GET_APARTMENT_TYPE = "Выберите тип жилья."
GET_PRICE = "Задайте интервал цен.\n" \
            "Можете выбрать один из доступных вариантов или задать интервал вручную, отправив сообщение.\n" \
            "Пример сообщения: 0-30000"

PRICE_ANSWER = "Цены: {} руб - {} руб"
RANDOM_FLAT_WAITING  = "Подбираю..."
RANDOM_FLAT_ANSWER = "*Цена:* {price} руб.\n\n" \
                     "*Метро:* {metro}.\n\n" \
                     "*Адрес:* {street} {house}.\n\n" \
                     "*Общее:* {object_type}, {area}, {floor}.\n\n" \
                     "*Подробнее:* {url}"
RANDOM_FLAT_ERROR = "Не удалось подобрать квартиру. Попробуйте еще раз."
RANDOM_FLAT_EMPTY = "Не удалось найти новую квартиру по вашим критериям."
APART_TYPE_ALERT = "Опция доступна, если выбрали тип предложения 'Купить'."
GET_PRICE_FROM_MSG_ALERT = "Не смог распознать цены, попробуйте еще раз в соответствии с примером."
UNKNOWN_ALERT = "Что-то пошло не так..."


NOTIFICATIONS_MAIN = "Выберите режим уведомлений и получайте квартиры каждый день!\n" \
                     "Бот будет присылать вам сообщения в соответствии с выбранным условием (время МСК):"
NOTIFICATIONS_ANSWER = "Уведомления настроены"
