START_MESSAGE = 'Привет!\n' \
                'Устал искать свое уютное гнездышко? Доверься мне!\n' \
                'Я могу подобрать случайную квартиру по твоим основным критериям ' \
                'из базы недвижимости ЦИАН (https://cian.ru/).'

SEARCH_TERMS = "Настройка критериев поиска.\n" \
               "Как минимум, выберите город и тип предложения."

GET_CITY = "Укажите город."
GET_DEAL_TYPE = "Ищем, чтобы снять или купить?"
GET_ROOMS = "Выберите количество комнат. Можно выбрать несколько вариантов."
GET_APARTMENT_TYPE = "Выберите тип жилья."
GET_PRICE = "Задайте интервал цен.\n" \
            "Можете выбрать один из доступных вариантов или задать интервал вручную, отправив сообщение.\n" \
            "Пример сообщения: 0-30000"
